let qnaArray1= [
    {q:"임시잠금 해제가 안돼요.",a:"안녕하세요. 따릉이입니다.<br><br>임시 잠금 해제가 안 풀리는 경우, 대부분 앱 설정 및 핸드폰 내의 프로그램에서 오류가 발생되는 경우가 대부분입니다.<br><br>아래 사항을 확인 후 재 실행 부탁드립니다.<br><br>1. 위치정보, 블루투스 활성화 여부 확인<br>2. 앱 종료 후, 로그인하여 앱 잠금 해제 <br>3. 핸드폰 종료 후, 앱 재 실행하여, 임시 잠금 해제 감사합니다."},
    {q:"대여하기 버튼을 눌렀으나, 대여 신청이 안돼요. (아이폰)",a:"※ 최초 대여신청을 했을때의 안내입니다.<br><br>계속 QR자전거가 대여되었는데, 특정자전거가 안될 경우 고장신고 부탁드립니다.<br><br>1. 앱의 경우, 현재 최신 버젼인지 먼저 확인을 합니다.<br><br>2. 앱 위치정보, 블루투스 관련 설정정보를 확인합니다.<br><br>위치 : 설정 > 개인정보보호> Bluetooth , 위치정보<br>- 위치정보, 블루투스가 설정되어 있어도, 설정요청 메시지가 나올 경우 따릉이 앱에 대한 위치정보 설정 필요 :  설정 > 앱목록 > 따릉이(참고)<br><br>* Bluetooth, 데이터 및 위치 서비스에 관하여<br>iOS 13 및 iPadOS 13에서 앱이 Bluetooth를 사용하려면 권한이 필요 없는 Bluetooth 기기로 오디오를 재생하는 경우를 제외하고 Bluetooth 기능 사용 권한을 요청해야 합니다.<br>설정 > 개인 정보 보호 > Bluetooth에서 기기의 Bluetooth 권한을 변경할 수 있습니다.<br><br>3. 연결되어 있는 블루투스 기기(스마트와치, 밴드, 이어폰 등)를 종료하고, 대여시도를 해봅니다.<br><br>4. 앱 내 실행되어 있는 앱(금융권, 카드사,증권사 등)을 종료하고 대여시도를 해봅니다.<br><br>5. 핸드폰을 종료하고 3~5초 정도 후, 다시 실행하여 자전거 대여시도를 해봅니다.<br><br>6. 네트워크 설정 초기화 확인 부탁드립니다. ( 설정 -> 일반 -> 재설정 -> 네트워크 재설정 )<br><br>7. 모두 해봤는데도 안 된다면, 시민의견 수렴에 부탁드립니다."},
    {q:"대여하기 버튼을 눌렀으나, 대여 신청이 안돼요.",a:"※ 최초 대여신청을 했을때의 안내입니다. <br><br>계속 QR자전거가 대여되었는데, 특정자전거가 안될 경우 고장신고 부탁드립니다.<br><br>1. 앱의 경우, 현재 최신 버젼인지 먼저 확인을 합니다.<br><br>2. 앱 위치정보, 블루투스 관련 설정정보를 확인합니다.<br><br>위치 : 설정 > 개인정보보호> Bluetooth , 위치정보<br>- 위치정보, 블루투스가 설정되어 있어도, 설정요청 메시지가 나올 경우 따릉이 앱에 대한 위치정보 설정 필요 :  설정 > 앱목록 > 따릉이(참고)<br><br>* Bluetooth, 데이터 및 위치 서비스에 관하여<br>iOS 13 및 iPadOS 13에서 앱이 Bluetooth를 사용하려면 권한이 필요 없는 Bluetooth 기기로 오디오를 재생하는 경우를 제외하고 Bluetooth 기능 사용 권한을 요청해야 합니다.<br>설정 > 개인 정보 보호 > Bluetooth에서 기기의 Bluetooth 권한을 변경할 수 있습니다.<br><br>3. 연결되어 있는 블루투스 기기(스마트와치, 밴드, 이어폰 등)를 종료하고, 대여시도를 해봅니다.<br><br>4. 앱 내 실행되어 있는 앱(금융권, 카드사,증권사 등)을 종료하고 대여시도를 해봅니다.<br><br>5. 핸드폰을 종료하고 3~5초 정도 후, 다시 실행하여 자전거 대여시도를 해봅니다.<br><br>6. 네트워크 설정 초기화 확인 부탁드립니다. ( 설정 -> 일반 -> 재설정 -> 네트워크 재설정 )<br><br>7. 절전모드 또는 V3 internet Security 에서 절전모드가 되어 있는지 확인합니다.<br><br>8. 모두 해봤는데도 안 된다면, 시민의견 수렴에 부탁드립니다."},
    {q:"따릉이 반납은 어떻게 하나요?",a:"○ 대여소 거치대에 거치한 후 뒷바퀴부분의 잠금장치를 당겨서 잠금합니다.<br>- 정상반납된 경우 단말기에서 '정상 반납되었습니다'라는 음성 메시지와 휴대폰으로 반납되었음을 알려주는 알림톡(문자)이 발송됩니다.<br>- 잠금을 완료하였으나 문자가 수신되지 않는 경우, 콜센터(1599-0120)로 즉시 문의하여주시기 바랍니다.<br>- 반납 거치대가 없는 경우, 최대한 거치대에 가까이 스탠드를 세우고 반납해주시기 바랍니다."},
    {q:"따릉이를 대여한 곳에만 반납해야 하나요?",a:"○ 대여하신 곳과 상관없이 가까운 따릉이 전용 대여소에 반납하시면 됩니다. 다만, 따릉이 전용대여소가 아닌곳에 자전거를 잠금하는 것(자가잠금 등)은 정상적인 반납이 아니며, “이용중”인 상태로서, 장기 방치시 추가요금이 발생합니다.<br><br>○ 가까운 대여소를 찾는 방법은 대여중 상태의  따릉이 앱에서   메인화면의  대여중 옆의 탭 "+"'가까운 대여소'"+"를 눌러 확인 가능합니다."},
    {q:"대여절차를 했는데 자전거 잠금장치가 해제되지 않아요.",a:"○ 잠금장치가 해제되지 않는 경우는<br>1) 대여비밀번호를 잘못 입력<br>2) 다른이용자가 해당 자전거의 대여신청을 한 경우(앱/현장 중복대여)<br>3) 단말기 고장 또는 통신상태에 일시 장애가 있는 경우 등입니다.<br><br>○ 전산상으로 대여 완료되었음에도 불구하고 잠금장치가 분리되지 않는 경우는  즉시 콜센터(1599-0120)로 연락주시면 조치하도록 하겠습니다.<br><br>※ 대여신청을 한 후 1분 후 미대여 시, 자동으로 대여신청이 취소됩니다."},
    {q:"대여나 반납은 24시간 가능한가요?",a:"○ 따릉이 대여소는 24시간 동안 운영합니다. <br>다만,  관련시스템의 보수,점검,장애, 대여소(임시)폐쇄, 기상상태 악화 등 비정상적인 상황, 또는 이러한 상황에 대비(복구)하기 위해 서비스 제공이 불가능한 경우 서비스 제공이 일시적으로 중단될 수 있습니다.<br>대여와 반납이 원할하지 않을 경우에 안내센터(1599-0120)으로 문의주시기 바랍니다. <br><br>○ 콜센터 근무시간은 00:00 ~ 24:00까지입니다."},
    {q:"단체대여는 어떻게 하나요?",a:"○ 단체권 구매<br>- 단체권 구매는 로그인> '이용권 구매'>'단체권 구매'를 합니다. (기존 이용권의 유효기간이 남아있어도 단체권 구매는 가능합니다.)<br>- 단체권은 구매할 때의 인원수 (최소 2명에서 최대 5명까지 가능)에 해당하는 만큼 대여할수 있습니다.<br><br>○ 단체권 사용법<br>1. 로그인을 하고 대여소를 선택합니다.<br>2. 이용권의 개수만큼 하단 대여하기 선택 후, QR코드를 순차적으로 스캔합니다.<br>3. 잠금장치가 해제되면 이용합니다."},
    {q:"반납했는데 미반납되었다는 문자가 왔습니다.",a:"○ 거치대에 자전거를 거치하였음에도 불구하고,<br>1. 잠금장치가 확실히 결합되지 않는 경우<br>2.간헐적 시스템(통신)오류<br>3. 단말기 장애 발생 등으로 자전거가 완전히 반납되지 않는 경우가 있습니다. 이를 방지하기 위해서<br>1) 자전거 반납시 잠금장치를 힘주어 결합해주시고 자전거를 반납한 후 반드시 반납완료 알림톡까지 확인 후 이동해주세요.<br>2) 기다려도 알림톡이 수신되지 않는 경우, 최종 반납장소를 기억하시고 따릉이 콜센터(1599-0120)로 즉시 연락주시기 바랍니다.<br>3) 따릉이 콜센터로 연락이 어려운 경우,반납장소 및 반납일시를 게시판(링크)에 글을 남겨주시면, 순차적으로 처리합니다."},
    {q:"자꾸 대여 실패가 발생합니다.",a:" ***따릉이 대여시 실패가 반복되신다면 다음 사항들을 확인 해 주십시오.***<br><br>1. 따릉이 앱 버전이 최신 버전인지 확인 해 주십시오. 최신 버전이 아니시라면 앱 삭제 후 스토어에서 최신 버전으로 설치 해 주세요. <br>* 바로가기만 지우시는 것이 아니라, 앱 자체를 지우셔야 합니다.<br>* 최신 버전이 아니라면 충돌이 발생할 가능성이 높아집니다. 꼭 최신 버전의 앱을 이용해 주세요.<br><br>2. 따릉이 앱 권한설정 확인 :    설정 > 애플리케이션 > 따릉이 > 권한 <br>* 위치, 저장공간, 전화, 카메라 권한 부여가 되어있는지 체크 해 주세요. 모든 권한이 허용되어 있어야 합니다.<br><br>3. 비행기 모드를 켰다가 끈 다음 위치와 블루투스 기능을 켜 주세요.<br><br>4. 휴대폰 네트워크(wifi, 블루투스, 기타 네트워크) 초기화 설정 > 일반 > 초기화 > 네트워크 설정 초기화<br>* 주의! ) 휴대폰에 저장된 wifi 비밀번호도 지워집니다. <br><br>5. 따릉이 앱 캐시 삭제 후 재실행<br>  안드로이드 : 설정 -> 애플리케이션 -> 따릉이 -> 저장공간 -> 데이터 삭제, 캐쉬 삭제<br>  아이폰 : 앱 -> 설정 -> 사파리 -> 방문기록 및 웹사이트 데이터 지우기<br><br>6. 갤럭시 스마트폰 최적화 프로그램 실행 : 갤럭시 스토어 -> Galaxy App Booster 실행으로 최적화(3~5분 소요)<br><br>7.  지도화면이 아닌 즐겨찾기 화면에서 따릉이 앱을 이용하시는 것을 추천 드립니다.<br>(1) 따릉이앱 - 메뉴 버튼 > 톱니바퀴 클릭 <br>(2) 메인화면 설정을 지도에서 즐겨찾기로 변경<br>(3) 텍스트 위주의 화면에서 내 위치 주변 탭을 클릭하여 원하는 대여소를 별표 클릭<br>(4) 해당 대여소 클릭후 자전거 대여 시도<br>* 지도화면에서 대여 시 메모리 점유율 및 저장용량의 영향이 있어 대여가 잘 안되실 수 있습니다. <br><br>8. 로그아웃, 재 로그인 후 재시도<br><br>9. 휴대폰 전원을 껐다 켜 보기<br>* 휴대폰을 주기적으로 재부팅 해 주시는 것은 앱 오류 가능성을 줄여 줄 수 있습니다. <br><br>10. 휴대폰에서 실행 중인 보안 프로그램들을 종료 후 재시도<br>* 휴대폰 내에 설치된 다른 어플(보안 프로그램, 금융권, 카드사, 증권사 앱 등)이 따릉이 앱의 정상 기능을 사용하지 못하도록 강제로 제어 할 수 있습니다. 해당 앱들을 종료하시고 대여를 시도해 주십시오.<br><br>11. 따릉이 앱이 백그라운드에서 돌아가게 될 경우 자동으로 로그인이 풀리는 등의 상황이  발생하여 자전거 대여시 제대로 연결되지 않는 경우가 있습니다. <br>* 앱 사용을 마치신 후 꼭 완전 종료를 해 주십시오. <br><br>12. 대여 실패시 다른 자전거로 대여 시도를 해 주십시오. <br>* 자전거(혹은 QR잠금장치/비콘 등)의 문제로 대여가 안될 수 있으므로 다른 자전거를 이용하여 주십시오.<br><br>13. 계속 QR자전거가 대여되었는데, 특정자전거가 안될 경우 고장신고 부탁드립니다. <br><br>14. 간헐적 시스템(통신/ 블루투스 연결) 오류가 발생할 수 있습니다. 이점은 시민 여러분들의 양해를 부탁 드립니다."}
];

let qnaArray2= [
    {q:"자전거 배치는 어떻게 이루어지고 있나요?",a:"○ 공공자전거는 강남, 강북관리소 산하, 각 권역(구)별로 전담 배송직원(팀)을 배치하여 운영하고 있습니다.<br>○ 각 배송직원에게는 대여소 현황 및 자전거 상태가 조회 가능한 전용 단말기가 지급되며, 매일 아침 해당 팀별 배치동선 등 확인 후 배차합니다."},
    {q:"자전거 추가배치를 신청하면 어떻게 반영되나요?",a:"○ 자전거 추가배치 신청시 해당 권역 배송원 및 관리 책임자의 자전거 관리 단말기에 배치 신청내역이 반영이 됩니다.<br>○ 해당 신청내역은 단기적으로는 해당일자 배차 동선 계획시, 장기적으로는 적정 자전거 대수 유지 관련 정책수립시 반영됩니다."},
    {q:"전반적으로 자전거가 너무 부족한 것 같습니다. 대응방안이 궁금합니다.",a:"저희 공공자전거는 적정자전거 배치 및 규모 산정을 위한 연구용역을 진행하고 있으며, 추가 배송, 정비인원 유치, 자전거 수급계획 등을 수립하여 운영하고 있습니다."}
];

let qnaArray3= [
    {q:"대여소 설치요청 하고싶어요.",a:"○ 대여소 개설 절차는 다음과 같습니다.<br>➀1단계: 대여소 개설에 관한 의견 수렴은 해당 구청 담당부서(교통행정과)에서 실시합니다.<br>➁단계: 구청에서 의견수렴을 거쳐 대여소 후보지를 통보하여 주면 공단은 기술적인 가능성여부를 검토후, 최종 후보지를 협의, 선정합니다.<br>(2020년 최종 대여소 설치 예정지는 앱>공지사항에 게시되어있습니다.)<br>➂단계: 최종 후보지에 대하여 다시한번 현장 시민의견 수렴 후  대여소를 최종설치 합니다.<br><br>○ 대여소의 개설,폐쇄는 공단이 독단적으로 결정하는 사안이 아닌, 관련 구청의 행정사항, 시민의견 및 기술적인 부분을 종합적으로 고려하여 처리하는 부분이므로, 관련 의견 즉시 처리 및 시행은  불가능합니다. (따릉이 게시판 등에 주시는 대여소 개설 관련 의견은 개별답변 없이, 대여소 관할구청에게 전달합니다.)<br><br>○ 대여소의 이전 또한 개개인의 의견이 달라 찬반이 갈리는 사안으 로 공단 단독으로 결정할 수 없기에 관할 구청과 협의하에 결정이 됩니다. 이에따라 즉시 처리 및 시행이 불가능함을 알립니다.<br><br>○ 참고로 대여소 설치를 위하여서는 보도폭 3m 이상이 확보되어야하 며, 해당 지역의 소유권자와의 협의문제,  전기,통신 시설물 설치 환경, 소화전 등 기타 시설물과의 배치 등이 종합적으로 고려되어야  함을 알려드립니다."},
    {q:"우리지역에 신규 설치 예정 대여소는?",a:"신규 대여소의 설치 예정지는 관할 구청으로부터 접수 받고 있으며, 사전 조사 후 공지될 예정입니다."},
    {q:"자주 가던 대여소가 갑자기 폐쇄되었어요. 언제 다시 운영하나요?",a:"대여소 영구폐쇄가 아닌 임시폐쇄의 경우 추후 재개통 됩니다. 임시폐쇄 대여소 내역 및 폐쇄기간은 홈페이지 “공지사항”에 게시되어 있습니다.(대여소 이름으로 검색) 임시폐쇄는 관할 지방자치단체의 행사나 공사등의 사유를 접수받아 진행하므로, 공공자전거에서 임시폐쇄기간의 연장 / 단축이 불가한점 양해부탁드립니다."},
    {q:"대여소 개설, 폐쇄, 이설 관련 문의입니다.",a:"대여소의 신규개설, 폐쇄, 이설 등은 주민간 찬반이 갈리는 사안으로 해당 자치구 교통행정과를 통해 신청해 주시면 감사하겠습니다."}
];

let qnaArray4= [
    {q:"요금제 및 결제수단(결제수단을 늘려주세요)",a:"○ 따릉이 결제수단은 현재 휴대폰 소액결제, 신용카드(체크카드 포함),카카오페이, 페이코,  제로페이 등입니다.<br><br>○ 이용자분의 편의 증대를 위하여, 점진적으로 결제시스템 보완이  이루어질 수 있도록 지속적으로 노력하고 있으며, 현재(2020.1)  네이버페이 및 티머니 마일리지 등을 추가 검토하고 있음을 알려드립니다.<br><br>▶이용요금안내 : https://www.bikeseoul.com/info/infoReg.do<br>또는 따릉이 앱 하단 이용안내>이용권 사용안내/환불규정보기<br><br>▶결제방법 : https://www.bikeseoul.com/app/use/moveUseMenuPayAcc.do<br>또는 따릉이앱 하단 이용안내>이용권구매/추가과금안내<br><br>○ 추가문의는 따릉이 콜센터 “1599-0120” 으로 전화주시기 바랍니다."},
    {q:"추가요금은 무엇이며 어떻게 결제하나요?",a:"○ 따릉이는 공공시설물로서 공공자전거입니다.<br>○ 따릉이는 공유자전거로서, 이용자가 오랜 기간동안 독점적인 이용을 막고, 더 많은 사람들이 자주 이용할 수 있도록 하기위해, 1회 대여시 기본대여시간(1시간 또는 2시간)을 설정하여 운영하고 있습니다.<br>기본대여시간을 초과하여 자전거를 반납하지 못하면, 초과 이용시간에 따른 요금이 별도로 부과됩니다 .  추가요금이 부과되지 않도록 꼭 기본대여시간 내에 따릉이 전용 거치대에 반납하시고 재 대여 해 주세요.<br><br>○ 추가요금은 기본 대여시간 초과시 5분당 200원이 부과됩니다. <br><br>○ 추가요금은 최초 이용권 결제시 사용한 결제수단으로 자동결제 됩니다.<br><br>○ 자동결제가 안되었을 경우 앱 > 메뉴 > 결제관리 > 추가과금결제에서 수동 결제가 가능합니다.<br>(제로페이의 경우 초과요금이 자동으로 결제되지 않기 때문에 따릉이 앱에 접속하여 수동결제를 하시거나 추가과금 수단등록을 통해 추후 결제 부탁드립니다. )<br><br>○ 추가요금의 다른 결제수단으로 변경을 원하시면  앱 >메뉴 > 결제관리 > 추가과금 수단변경 메뉴에서 변경 설정 가능합니다.<br><br>○ 카드나 휴대폰으로 결제가 불가할 경우  따릉이 콜센터 1599-0120으로 연락 주셔서 접수하신 후,  우리은행  1005-702-927521 서울시설공단으로 계좌이체 후 다시 전화주시면  상담원이 확인 후 처리해드립니다."},
    {q:"환불신청 방법, 환불규정, 입금 처리는 언제 되나요?",a:"○ 환불 신청 방법 : 앱> 나의공간> 결제관리> 결제내역 화면  환불/취소 항목에서 환불 글씨를 눌러 환불계좌,은행명, 예금주명 등을 입력하여 진행하시면 됩니다.<br><br>○ 환불규정 : 앱 중앙하단  이용안내><br>※ 이용권 사용안내/환불 규정 보기<br><br>※ 이용권 사용한 경우(이용권 개시일 기준)<br>   1일권 : 환불불가 , 7일권 : 2일이내, 30일권 : 7일이내, 180일권 : 60일이내, 365일권은 150일이내 신청해야만 환불이 가능합니다.<br><br>○ 이용개시일로부터 환불 접수일자가 오래 경과 될수록 환불액은 줄어들며, 없을 수도 있습니다.<br><br>○  입금은 환불신청하신 날짜 기준으로  2주 ~3주가량 소요 될 수 있으나 사정에 따라 늦어질 수 도 있는 점 양해 부탁드립니다.<br><br>○ 환불 진행이 잘 안되시면 콜센터 1599-0120으로 문의 부탁 드립니다."},
    {q:"이용권 만료 전 정기결제가 되나요?",a:"○  이용권 정기결제 기능은 지원되고있지 않습니다.<br>○ “ 정기결제 ” 는 기본 대여시간을 초과하여 이용시 발생되는 추과과금의 자동결제를 위하여 전자결제업체인 엘지 유플러스에서 사전 승인을 받는다는 의미로 사용되고 있습니다 .  이에 대한 공공자전거 별도의 문구를 만들 수 없어 정기결제 메시지로 대신 표출되는 부분을 양해 부탁드립니다."},
    {q:"제로페이 결제 오류 시 확인사항",a:"1. 결제사 앱, 따릉이 앱 최신 버젼 확인 여부 ( 플레이스토어, 앱스토어에서 확인 필요 )<br><br>2. 앱에서 결제 안 될 경우, 모바일웹에서도 결제 시도 부탁드립니다. ( 해당 모바일웹에서도 안 될 경우, 해당 웹 브라우저의 앱을 업데이트 부탁드립니다. - 기본 설정 웹 브라우져 ( 삼성 - 삼성인터넷, 구글 등 )"}
];

let qnaArray5= [
    {q:"따릉이를 타고 가다가 고장이 났는데 어떻게 해야 하나요?",a:"○ 고장난 자전거를 가까운 대여소에 반납하시고 스마트폰 앱이나 전화로 (1599-0120) 고장 신고 해 주세요.<br>파손이 심하거나  이동이 어려울 경우   자전거 좌측의 셀프락 줄을 풀어  고정된 시설물에 두르거나,  자전거 앞바퀴 사이로 통과시킨 후  단말기 우측 잠금장치 홈에 꽂는 셀프락을 하신 후 콜센터 1599-0120으로  신고해주세요."},
    {q:"공공자전거 따릉이의 브레이크의 앞뒤 브레이크는 어느쪽인가요?",a:"○ 따릉이의 앞브레이크는 왼쪽, 뒷브레이크는 오른쪽입니다.<br> - 이것은 재경부 산하 기술표준원 고시 제2009-0978(2009.12.30)에 의해 2010년도 기준으로 다음과 같이 변경이 되었습니다.<br> ※ 2010년도 이전 자전거는 왼쪽이 뒷브레이크 오른쪽이 앞브레이크로 되어있었습니다.<br>  ※ 2010년도 이후 자전거는 왼쪽은 앞브레이크 오른쪽은 뒤브레이크로 변경이 되었습니다.<br><br>○ 따릉이 브레이크 사용요령 관련하여 앞브레이크는 정지역할이고 뒷브레이크는 속도조절 역할을 하기 때문에 실제 정지시에는 앞․뒤브레이크를 동시에 사용하여 정지하셔야 합니다.<br> ※ 앞브레이크만 사용시 고속에서는 전복의 위험성이 있습니다.<br><br>○ 추가문의는 안내센터 “1599-0120” 으로 전화주시면 처리해 드릴 수 있도록 도움 드리겠습니다."},
    {q:"자전거 안장이 너무 낮아요(높아요)",a:"○ 서울 공공자전거 따릉이 브랜드 및 디자인은 최초 개발시 수차례 전문가 자문 및 시민 선호도 조사 등을 통하여 개발된 사항으로, 다양한 계층의 시민들이 이용할 수 있도록 고려되다 보니 24인치 휠의 소형자전거 형태로 구성되어 있습니다.<br><br>○ 디자인시 시트 및 하부구조로 인하여 6단까지 최적의 안정적인 구조로 사용될 수 있도록 운영되어 왔으며, 시민의견 등을 반영하여 현재 시트가 확보할 수 있는 안전허용치 내 8단까지 확대하였고, 8단 이상은 프레임 및 시트구조로 인한 안정성을 확보하기 어렵사오니, 양해부탁드립니다.<br><br>○ 또한 기존 따릉이의 안장높이 조절은 이용자 조임방식의 페달축으로부터 43~58cm까지 조절할 수 있는 모델이며, 높이조절량을 알기쉽게 8단계로 나누어 표시한 모델입니다. 다만 이용자 조임방식의 이용불편 등에 대한 다양한 의견 등을 수렴하여, 신규 따릉이의 안장높이 조절은 간단한 레버방식으로 페달축으로부터 50~60cm까지 조절할 수 있는 모델이며, 높이조절량을 5단계로 나누어 표시한 모델임을 알려드립니다."},
    {q:"자전거에 핸드폰 거치대가 있었으면 좋겠어요",a:"자전거 핸드폰 거치와 관련하여, 공공자전거 검토하였으나,<br><br> ➀ 핸드폰 거치대로 인한 2차 피해발생 우려(전방주시 미흡)<br> ➁ 자전거 사고발생 시 핸드폰 파손에 대하여 보상문제 발생 등으로, 도입되지 않았음을 알려드립니다."},
    {q:"자전거 기어 단수가 너무 낮습니다.",a:"○ 자전거 활성화를 통한 녹색교통체계를 구축하기 위하여 근거리 교통보조수단용으로 설계·제작된 따릉이는 공공자전거라는 특성상 다양한 이용시민의 안전을 고려하지 않을 수 없었으므로, 속도에 제한을 두고자 내장형 3단기어로 운영중인 사항이므로, 양해부탁드립니다."},
    {q:"공공자전거 이용중 사고가 났는데 어떻게 해야 하나요?",a:"○ 따릉이 이용중 사고가 났을 경우, 공공자전거 종합보험에 의거 처리되며, 보험 접수는 이용자 본인이 직접 보험사에 하셔야 합니다.<br><br>▶ 접수처 : DB손해보험(Tel : 02-1899-7751)  ※ 보험금 청구서 양식에 따라 접수<br>▶ 보험사 영업시간 : 09:00~18:00(토요일 및 공휴일 휴무)  <br>▶ 처 리 : 보험사에서 접수 완료후 담당자 개별 통보<br><br>○ 따릉이의 결함, 관리상 하자로 인해 이용자 본인 및 제3자의 신체가 장해를 입은 경우 또는 재물이 망가진 사고의 경우 영조물 배상보험에 의거 처리되며, 공단에서 보험 접수합니다.<br><br> ▶ 접       수 : 서울시설공단 (Tel : 02-1599-0120 )<br> ▶ 영업시간 : 00:00~24:00 (연중무휴)<br> ▶ 처      리 : 한국지방재정공제회의 위임을 받은 손해보험사에서 접수 후,   배상금 지급 개별통지<br><br>○보험사 안내 관련 문의 : 따릉이 콜센터(1599-0120 / 24시간 운영,  단, 사고 접수는 07:00~22:00)<br><br>※ 보장 내용 및 보장 한도액, 보험금 지급사유별 첨부서류 등 보다 자세한 내용은 홈페이지, 앱 하단 보험안내 부분을 참조하여  주시기 바랍니다."}
];

let qnaArray6= [
    {q:"대여반납 이력 조회 관련 안내드립니다.",a:"안녕하세요. 따릉이입니다. <br><br>현재 따릉이 앱에서는 앱 안정성을 위해, 최소한의 정보만 표출되고 있음을 안내드리며, 따릉이 홈페이지를 모바일 또는 PC를 이용하실 경우, 자세한 정보를 확인 가능함을 안내드립니다.<br><br>PC : 나의 공간 > 이용정보 관리 > 대여반납이력<br>핸드폰 : 우측 삼선버튼 > 이용정보 관리 > 대여반납 이력<br><br>감사합니다."},
    {q:"신규 앱 대여시 QR 대여가 안 되실 경우",a:"1. 위치, 블루투스 연결 확인<br><br>2. 속도가 느리거나, 연결이 안 되실 경우 앱 업데이트 여부 확인<br><br>3. 핸드폰 종료 후 재실행<br><br>4. 앱 종료 후, 재실행<br><br>5. 즐겨찾기 탭을 눌러서, 텍스트 화면에서 대여하기 버튼 눌러 대여시도"},
    {q:"신규 앱 지도 관련 개선사항 안내",a:"* 하단 지도 위에서 동그라미 버튼을 누르실 경우, <br><br>한번 선택 : 내위치 표출<br>두번 선택 :  방향 표시<br>세번 선택 : 내위치 제거 입니다.<br><br>* 대여소 선택시 아래 하단 화살표를 누르실 경우, 네이버지도 연계되어, 길찾기 서비스가 제공됩니다."},
    {q:"QR 자전거 대여관련 확인안내. (아이폰)",a:"※ 최초 대여신청을 했을때의 안내입니다. 계속 QR자전거가 대여되었는데, 특정자전거가 안될 경우 고장신고 부탁드립니다.<br><br>1. 앱의 경우, 현재최신 버젼인지 먼저 확인을 합니다.<br><br>2. 앱 위치정보, 블루투스 관련 설정정보를 확인합니다.<br>     위치 : 설정 > 개인정보보호> Bluetooth , 위치정보<br>   - 위치정보, 블루투스가 설정되어 있어도, 설정요청 메시지가 나올 경우<br>      따릉이 앱에 대한 위치정보 설정 필요 : <br>설정 > 앱목록 > 따릉이 <br>(참고) * Bluetooth, 데이터 및 위치 서비스에 관하여 <br>       iOS 13 및 iPadOS 13에서 앱이 Bluetooth를 사용하려면 권한이 필요 없는 Bluetooth 기기로 오디오를 재생하는 경우를 제외하고 Bluetooth 기능 사용 권한을 요청해야 합니다.<br>      설정 > 개인 정보 보호 > Bluetooth에서 기기의 Bluetooth 권한을 변경할 수 있습니다.<br><br>3. 연결되어 있는 블루투스 기기(스마트와치, 밴드, 이어폰 등)를 종료하고, 대여시도를 해봅니다.<br><br>4. 앱 내 실행되어 있는 앱(금융권, 카드사,증권사 등)을 종료하고 대여시도를 해봅니다.<br><br>5. 핸드폰을 종료하고 3~5초 정도 후, 다시 실행하여 자전거 대여시도를 해봅니다.<br><br>6. 네트워크 설정 초기화 확인 부탁드립니다. ( 설정 -> 일반 -> 재설정 -> 네트워크 재설정 ) <br><br>7. 모두 해봤는데도 안 된다면, 시민의견 수렴에 부탁드립니다."},
    {q:"QR 자전거 대여관련 확인안내",a:"< QR 따릉이와 연결이 되지 않을 경우 확인방법><br><br>※ 무선 이어폰 등 블루투스기기 사용 시 연결이 어렵습니다. 연결 해제 후 시도해주시기 바랍니다.<br><br>1. 따릉이 앱 최신버전 업데이트 <br>(앱 초기 구동화면에서 버전 확인 가능하며 버전 정보가 없을 시 구버전 앱이므로 구글플레이에서 업데이트 해주시기 바랍니다.)<br><br>2. 화면 상단 ‘위치(GPS)’ 와 ‘블루투스’ 기능 ON <br><br>3.  ‘설정’ - ‘애플리케이션’ - ‘따릉이’ – ‘권한’에서 카메라, 위치 권한 ON<br><br>4. 절전모드가 켜져있거나 V3 internet Security 등 백신앱 에서 절전모드가 되어있다면 해제합니다.<br><br>5. 위 4가지 방법으로 연결이 안될 경우에는 아래와 같이 진행 후 사용 해보시기 바랍니다. <br>  - 설정 - 일반 - 초기화 - 네트워크 재설정을 통해 블루투스 설정을 초기화합니다. <br>     (초기화할 경우 Wi-Fi, 모바일 데이터, 블루투스 등의 연결 기록들이 모두 삭제 됩니다)<br>  - 휴대전화를 재부팅한 후 대여를 시도합니다.<br><br>※ 블루투스 관련 안내링크 참조 <br>삼성기기 :  https://www.samsungsvc.co.kr/online/faqView.do?faqId=KNOW0000039846<br><br>* 위의 내용으로도 따릉이 대여가 안되시거나 원격지원 등 자세한 상담을 원하시면 아래 링크를 클릭하여 문의해주시기 바랍니다.  <br>https://www.bikeseoul.com/customer/opinionBoard/opinionBoardList.do"},
    {q:"환승마일리지란?",a:"○ 대중교통 환승마일리지란?<br> - 대중교통 환승마일리지는 정기권 365일 이용시민에 한하여 <버스/지하철->따릉이> 혹은 <따릉이->버스/지하철> 로 30분 이내에 환승할 경우에 적립되는 마일리지입니다.<br>- 따릉이에서 대중교통으로 / 대중교통에서 따릉이로 순서에 상관없이 1회에 100점,<br>   하루 최대 2회로 200점까지 적립되며, 1년동안 최대 15,000 점까지 적립됩니다.<br>   따릉이 이용권중 365일 정기권 구매시에만, 마일리지로  일부 결제 가능합니다.<br><br>- 마일리지 적립을 위해서는 대중교통 환승카드를 앱에 등록해야 합니다.<br>  ->로그인 -> 나의공간 -> 회원정보 관리->카드등록(대여,환승) -><br>    환승카드 탭 클릭-> 정보제공 동의-> 카드 등록<br><br>※ 환승카드는 따릉이 대여카드와 동일하거나  동일하지 않아도 상관없으나, 환승카드란에는 대중교통 이용시 사용하는 교통카드(혹은 후불카드) 번호를 반드시 등록 저장하셔야 적립이 가능합니다.<br>더불어, 환승카드의 경우 따릉이에서 티머니사로 카드번호를 전송하여, 해당 번호에 대한 결과를 받아오는 구조로, 대중교통 이용시 티머니사로 전달되는 카드번호가 상이할 경우, 적립이 안 되실 수 있는 점 안내드리며, 꼭 4일 후에 적립여부 확인이 필요한 점 안내드립니다. <br><br>※ 대중교통 이용시 모바일티머니로 이용하시면 따릉이 앱 환승카드란에 실물카드 번호가 아닌 모바일티머니카드 번호를  등록하셔야  됩니다.<br><br>※ 현재 KBANK, 신한 아멕스카드(15자리) 카드, 지하철 정기권, 모바일 페이의 경우 적립이 불가하오니, 해당 카드 이외의 카드 사용을 부탁드립니다."},
    {q:"마일리지가 적립되지 않았습니다.",a:"마일리지 적립을 위해서는 <br><br>1. 365일 이용권 구매<br><br>2. 따릉이 앱 로그인 후 -> 메뉴 -> 회원정보 관리 -> 카드 등록 -> 환승 카드란에 평소 대중교통 이용시 사용하는 카드 번호 입력 <br><br>3. 따릉이 <-> 대중교통을 30분 이내 이용할 경우 1회 100점, 하루 최대 200점, 연 최대 15,000점까지 적립이 되고 있습니다. <br>따릉이 앱에 안내된 것처럼 KBANK, 신한 아멕스카드(15자리), 지하철 정기권, 모바일 페이등의 경우 카드사 정책에 의해 적립이 불가합니다.<br>만약 위의 등록 불가 카드가 아닌 경우에도 적립이 되지 않는 다면 겸용 카드로 1개의 카드에 두 개의 카드 번호가 존재하는 경우가 종종 있습니다.<br> 이는 이용자님의 카드사로 문의하여 대중교통 결제시 이용되는 카드 번호를 반드시 확인하여 주시기 바라며 번호가 다른 경우 따릉이 앱에서 새로 입력하여 이후부터 마일리지 적립이 가능함을 안내드립니다. "},
    {q:"대중교통 환승카드 등록은 어떻게 하나요?",a:"○ 환승카드 등록방법(마일리지적립)<br><br>▶ T-MONEY, 후불교통카드<br> -  홈페이지 / 스마트폰앱에 로그인 -> “나의공간>회원카드등록>환승카드” -> 카드번호 16<br>   자리입력 카드 등록 완료<br><br>▶ 모바일티머니<br><br><br> -  모바일티머니 앱에 자동생성된 새로운 모바일티머니 카드번호를 따릉이 앱 또는 홈페이지의 환승카드란에 새로 입력해야 합니다.<br><br>※ 참고로, 환승마일리지는 365일 정기권 이용시민이 가능하며, 따릉이 이용후 30분 이내 버스 또는 지하철 이용 / 버스 또는 지하철 이용후 30분 이내 따릉이 이용시에 1회에 100포인트 적립되고  1일 최대 200포인트 적립되며, 연간 15000포인트 적립됩니다.<br><br>○ 추가문의는 안내센터 “1599-0120” 으로 전화주시면 처리해 드릴 수 있도록 도움 드리겠습니다."},
    {q:"따릉이 알림톡이 안와요!!",a:"○  알림톡 수신거부를 하신 경우, 알림톡이 아닌 '문자' 로 데이터가 전송 되게 됩니다.<br>     수신거부를 하고 계신것은 아닌지 확인해 주세요.<br><br>※수신 해제 방법<br>    카카오톡 -> 설정 -> 친구 -> 차단친구 관리 -> 친구 선택 후 '해제'<br>※ 친구 추가 방법<br>   카카오톡 친구 검색 -> '서울자전거 따릉이 알림톡' 검색 후 -> 친구 등록"},
    {q:"따릉이 알림톡을 차단했는데, 다시 받고 싶습니다.",a:"○ 카카오 알림톡 차단을 수행 하신 경우 혹은 친구차단을 하신 경우 알림톡을 수신하실수 없습니다.<br>○ 카카오톡-플러스 친구 검색-서울자전거따릉이 알림톡-친구 추가<br>○ 카카오톡>설정>친구>차단친구 관리>친구 선택 후 '해제'<br>○ 카카오톡 친구검색>'서울자전거 따릉이 알림톡' 검색 후>친구 등록"},
    {q:"따릉이 카카오 친구 차단 후에도, 알림이 계속 와요~(받기 싫어요!)",a:"○ 카카오톡>설정>친구>차단친구관리>친구 풀기> 기존의 대화방('서울 자전거 따릉이 알림톡') 으로 이동>상단의 '알림톡 받지않기' 버튼 클릭"},
    {q:"앱상 자전거 수량표시와 실제 자전거 수량이 달라요",a:"앱상 자전거 수량은, 대여가능 자전거의 거치대 수량으로, 연결반납된 자전거의 경우, 자전거의 대수와 상관없이 1로 표시됩니다.<br>또한, 고장신고 된 자전거는 대여할 수 없으므로  어플의 대여소 현황에 나타나지않아  수량차이가 날 수 있습니다.<br>그밖에도, 통신 지연 등으로 인해, 대여가능자전거수가 실시간으로 반영되지 못하는 경우도 있습니다. 이를 보완하기 위하여, 개선된 통신방식의 신규 자전거 단말기를 도입 예정이오니, 많은 이해 부탁드립니다."},
    {q:"아이폰 앱 업데이트가 되지 않을 경우",a:"안녕하세요. 따릉이입니다.<br>아이폰 앱 업데이트 실행시, 업데이트가 되지 않는 경우,<br><br>1. 앱 삭제 후, 앱 재설치<br><br>2. 휴대폰 전원 종료 후, 업데이트 실행<br><br>아이폰 앱의 경우, 아이폰 내에서 설치시 아이폰 자체 내에서 에러가 발생되는 점이 발생되는 바 공지드립니다.<br><br>감사합니다."}
];

let qnaArray7= [
    {q:"대여반납 이력 조회 관련 안내드립니다.",a:"안녕하세요. 따릉이입니다. <br><br>현재 따릉이 앱에서는 앱 안정성을 위해, 최소한의 정보만 표출되고 있음을 안내드리며, 따릉이 홈페이지를 모바일 또는 PC를 이용하실 경우, 자세한 정보를 확인 가능함을 안내드립니다.<br><br>PC : 나의 공간 > 이용정보 관리 > 대여반납이력<br>핸드폰 : 우측 삼선버튼 > 이용정보 관리 > 대여반납 이력<br><br>감사합니다."}
];

let qnaArray8= [
    {q:"요금제를 다양하게해주세요 (30분권, 3시간권 등)",a:"○ 공공자전거 이용권은 사용기간중 1회 대여권이 아닌,  이용권 유효기간까지 1회 대여시 기준시간(1시간권,2시간권) 내로 반납하면, 추가요금 없이 반복적으로 대여 및 반납가능한 시스템입니다.<br>  (기준시간 초과하여 미반납시에만 추가요금 발생)<br>   (예를들어 1시간권(365일권) 구매시, 대여시마다 1시간이내 반납하면 이용권 개시일로부터 365일간 횟수제한 없이 반복이용 가능하며, 1 시간 초과하여 반납시, 반납시를 기준으로 5분당 200원의 초과요금이 부과됨)<br><br>○ 이는 자전거 1인 독점 사용을 제한하고, 자주 이용하는 고객께는 1 회 이용권 대비 저렴한 단가에 자전거를 반복적으로 이용할 수 있도록 하기위한 정책적인 결정 하에 운영되고 있는 시스템인 바, 불편함이 있더라도 이해하여주시기 바랍니다."}
];

  function clickMenu(num){
    var x= document.getElementsByClassName('accordion')
    for(var i=0; i<x.length;i++){ 
        x[i].style.display= 'none'
     }
    switch(num){
        case 0: x[num].style.display= 'block'; break
        case 1: x[num].style.display= 'block'; break
        case 2: x[num].style.display= 'block'; break
        case 3: x[num].style.display= 'block'; break
        case 4: x[num].style.display= 'block'; break
        case 5: x[num].style.display= 'block'; break
        case 6: x[num].style.display= 'block'; break
        case 7: x[num].style.display= 'block'; break
    }

    
}

// function qna_add(qnaArray){
//     let title= document.getElementById('qna_q_title')
//     let content= document.getElementById('qna_q_content')
//     let num= title.innerHTML
//     title.innerHTML= qnaArray[num].q
//     content.innerHTML= qnaArray[num].a
// }

// function qna_switch(num){
    
// }

// function qna_total(qnaArray){
//     for(var i=0; i<qnaArray.length; i++){
//     let total= document.getElementById('total')
//     total.innerHTML="<div class='accordion-item'><h2 class='accordion-header' id='headingOne'>"+
//         "<button class='accordion-button' type='button' data-bs-toggle='collapse' data-bs-target='#collapseOne' aria-expanded='true' aria-controls='collapseOne'>"+
//           "<span id='qna_q_title'>"+qnaArray[i].q+"</span>"+
//         "</button></h2>"+
//       "<div id='collapseOne' class='accordion-collapse collapse show' aria-labelledby='headingOne' data-bs-parent='#accordionExample'>"+
//         "<div class='accordion-body'>"+
//           "<span id='qna_q_content'>"+qnaArray[i].a+"</span>"+
//         "</div></div></div></div>"
//         qna_add(qnaArray1)
//     }
// }

// function qna_add(qnaArray){
//     let table= document.getElementById('qna_table')
//     for(var i=0; i<qnaArray.length; i++){
//         let tr= document.createElement('tr')
//         let qnaQImg= document.createElement('td')
//         let q1= document.createElement('img')
//         q1.src= "https://www.bikeseoul.com/img/faqlist_q.png"
//         qnaQImg.appendChild(q1)
//         let qnaQ= document.createElement('td')
//         qnaQ.appendChild(document.createTextNode(qnaArray[i].q))
//         qnaQ.onclick= click_q
//         let qnaAImg= document.createElement('td')
//         let q2=document.createElement('img')
//         q2.src= "https://www.bikeseoul.com/img/arr_open.png"
//         qnaAImg.appendChild(q2)
//         tr.appendChild(qnaQImg)
//         tr.appendChild(qnaQ)
//         tr.appendChild(qnaAImg)
//         table.appendChild(tr)
//     }
// }

// function click_q(){
    
// }

// function clickMenu(){
//     switch(){
        // qna_add_title(qnaArray1)
        // qna_add(qnaArray1)
//     }
    
// }
